app/Controllers/Main.php

SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `firstname` LIKE '%%' ESCAPE '!'
OR  `lastname` LIKE '%%' ESCAPE '!'
OR  `middlename` LIKE '%%' ESCAPE '!'
SELECT *
FROM `user`
WHERE `firstname` LIKE '%%' ESCAPE '!'
OR  `lastname` LIKE '%%' ESCAPE '!'
OR  `middlename` LIKE '%%' ESCAPE '!'
ORDER BY `id` ASC
 LIMIT 10
---
    public function getUsers(){

       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();

       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $searchValue = $dtpostData['search']['value']; // Search value

       ## Total number of records without filtering
       $users = new UserModel();
       $totalRecords = $users->select('id')
                     ->countAllResults();

       ## Total number of records with filtering
       $totalRecordwithFilter = $users->select('id')
            ->orLike('firstname', $searchValue)
            ->orLike('lastname', $searchValue)
            ->orLike('middlename', $searchValue)
            ->countAllResults();

       ## Fetch records
       $records = $users->select('*')
            ->orLike('firstname', $searchValue)
            ->orLike('lastname', $searchValue)
            ->orLike('middlename', $searchValue)
            ->orderBy($columnName,$columnSortOrder)
            ->findAll($rowperpage, $start);